TEXTS = {
    "contacts_info": {
        "ru": (
            "📞 *Служба поддержки пациентов:*\n"
            "+7 777 079 3165\n\n"
            "🏢 *Центральный офис:*\n"
            "г. Астана, район Есиль, пр. Қабанбай Батыр, 11/5, офис 710\n"
            "info@hemcenter.kz\n\n"
            "🏥 *«Центр гематологии» в г. Астана:*\n"
            "ул. Кенесары 4Б (будни с 08:00 до 17:00)\n"
            "тел. +7 771 9000864, +7 777 532 6515\n\n"
            "🏥 *Филиал в г. Усть-Каменогорск:*\n"
            "ул. Серикбаева, здание 5, корпус 1, второй этаж\n"
            "тел. +7 747 095 5650 (будни с 08:00 до 17:00)\n"
            "vko@hemcenter.kz\n\n"
            "🏥 *Филиал в г. Караганда:*\n"
            "пр. Сейфуллина, дом 17, второй этаж\n"
            "тел. +7 747 095 5650 (будни с 08:00 до 17:00)\n"
            "karaganda@hemcenter.kz"
        ),
        "kz": (
            "📞 *Пациенттерді қолдау қызметі:*\n"
            "+7 777 079 3165\n\n"
            "🏢 *Орталық кеңсе:*\n"
            "Астана қ., Есіл ауданы, Қабанбай батыр даңғылы, 11/5, 710-кеңсе\n"
            "info@hemcenter.kz\n\n"
            "🏥 *Астана қ. «Гематология орталығы»:*\n"
            "Кенесары көшесі 4Б (апта ішіндегі жұмыс уақыты: 08:00-17:00)\n"
            "тел. +7 771 9000864, +7 777 532 6515\n\n"
            "🏥 *Өскемен қ. филиалы:*\n"
            "Серікбаев көшесі, 5-ғимарат, 1-корпус, екінші қабат\n"
            "тел. +7 747 095 5650 (апта ішіндегі жұмыс уақыты: 08:00-17:00)\n"
            "vko@hemcenter.kz\n\n"
            "🏥 *Қарағанды қ. филиалы:*\n"
            "Сейфуллин даңғылы, 17-үй, екінші қабат\n"
            "тел. +7 747 095 5650 (апта ішіндегі жұмыс уақыты: 08:00-17:00)\n"
            "karaganda@hemcenter.kz"
        ),
        "en": (
            "📞 *Patient Support Service:*\n"
            "+7 777 079 3165\n\n"
            "🏢 *Central Office:*\n"
            "Astana city, Yesil district, Kabanbay Batyr ave. 11/5, office 710\n"
            "info@hemcenter.kz\n\n"
            "🏥 *Hematology Center in Astana:*\n"
            "Kenessary St. 4B (weekdays from 08:00 to 17:00)\n"
            "Tel: +7 771 9000864, +7 777 532 6515\n\n"
            "🏥 *Branch in Ust-Kamenogorsk:*\n"
            "Serikbayev St., building 5, block 1, second floor\n"
            "Tel: +7 747 095 5650 (weekdays from 08:00 to 17:00)\n"
            "vko@hemcenter.kz\n\n"
            "🏥 *Branch in Karaganda:*\n"
            "Seifullin ave., building 17, second floor\n"
            "Tel: +7 747 095 5650 (weekdays from 08:00 to 17:00)\n"
            "karaganda@hemcenter.kz"
        )
    },
    "choose_lang": {
        "ru": "Пожалуйста, выберите язык:",
        "kz": "Тілді таңдаңыз:",
        "en": "Please choose your language:"
    },
    "main_menu_prompt": {
        "ru": "Какая информация вас интересует?",
        "kz": "Сізді қандай ақпарат қызықтырады?",
        "en": "What information are you interested in?"
    },
    "auth_prompt": {
        "ru": "Для просмотра данных необходимо пройти авторизацию по номеру телефона.",
        "kz": "Деректерді көру үшін телефон нөмірі арқылы авторизациядан өтуіңіз қажет.",
        "en": "To view the data, you need to authorize via phone number."
    },
    "personal_data_prompt": {
        "ru": "Выберите интересующий пункт:",
        "kz": "Қажетті бөлімді таңдаңыз:",
        "en": "Choose an item:"
    },
    "current_hospital_prompt": {
        "ru": "У вас есть текущая госпитализация. Что вы хотите посмотреть?",
        "kz": "Сізде ағымдағы госпитализация бар. Не көргіңіз келеді?",
        "en": "You have an active hospitalization. What would you like to see?"
    },
    "select_visit_date_prompt": {
        "ru": "Выберите дату обращения:",
        "kz": "Қабылданған күнді таңдаңыз:",
        "en": "Please select a visit date:"
    },
    "select_presc_day_prompt": {
        "ru": "Выберите дату:",
        "kz": "Күнді таңдаңыз:",
        "en": "Select date:"
    },
    "enter_iin_prompt": {
        "ru": "Введите ИИН:",
        "kz": "ЖСН енгізіңіз:",
        "en": "Enter IIN:"
    },

    "auth_success_first": {
    "ru": "✅ Авторизация по номеру {phone} прошла успешно.\n👤 Пациент: {full_name}\n{main_menu}",
    "kz": "✅ {phone} нөмірі арқылы авторизация сәтті өтті.\n👤 Пациент: {full_name}\n{main_menu}",
    "en": "✅ Authorization with number {phone} successful.\n👤 Patient: {full_name}\n{main_menu}"
    },
    "auth_success_repeat": {
    "ru": "👤 Пациент: {full_name}\n{main_menu}",
    "kz": "👤 Пациент: {full_name}\n{main_menu}",
    "en": "👤 Patient: {full_name}\n{main_menu}"
    },
    "visit_count_title": {
        "ru": "Обращения пациента:",
        "kz": "Пациенттің қаралу саны:",
        "en": "Patient Visits:"
    },

    "menu_main": {
    "ru": [["Контакты 📕", "Личный кабинет 💼"], ["Смена языка 🌐"]],
    "kz": [["Байланыстар 📕", "Жеке кабинет 💼"], ["Тілді өзгерту 🌐"]],
    "en": [["Contacts 📕", "Account 💼"], ["Change Language 🌐"]]
    },
    "menu_after_login": {
    "ru": [["Личные данные 👤", "Записи 📋"], ["Главное меню"]],
    "kz": [["Жеке мәліметтер 👤", "Жазбалар 📋"], ["Басты мәзір"]],
    "en": [["Personal Data 👤", "Appointments 📋"], ["Main Menu"]]
    },
    "personal_menu": {
    "ru": [["Количество обращений 📊", "Выписки/Заключения 📄"], ["Текущая госпитализация 🏥"], ["Назад"]],
    "kz": [["Қаралу саны 📊", "Қорытындылар 📄"], ["Ағымдағы госпитализация 🏥"], ["Артқа"]],
    "en": [["Visit Count 📊", "Discharge Summaries 📄"], ["Current Hospitalization 🏥"], ["Back"]]
    },
    "back_menu": {
        "ru": [["Главное меню", "Назад"]],
        "kz": [["Басты мәзір", "Артқа"]],
        "en": [["Main Menu", "Back"]]
    },
    "main_menu_btn": {
        "ru": "Главное меню",
        "kz": "Басты мәзір",
        "en": "Main Menu"
    },
    "back_btn": {
        "ru": "Назад",
        "kz": "Артқа",
        "en": "Back"
    },
    "auth_button": {
        "ru": "Авторизоваться по номеру ☎️",
        "kz": "Телефон нөмірі арқылы авторизация ☎️",
        "en": "Authorize via phone ☎️"
    },
    "visit_still_open": {
        "ru": "по сей день",
        "kz": "бүгінге дейін",
        "en": "to this day"
    },
    "prescriptions_btn": {
        "ru": "Назначения 💊",
        "kz": "Таңдалымдар 💊",
        "en": "Prescriptions 💊"
    },
    "vitals_btn": {
        "ru": "Показатели 🩺",
        "kz": "Көрсеткіштер 🩺",
        "en": "Vitals 🩺"
    },
    "make_appointment_btn": {
        "ru": "Записаться на консультацию",
        "kz": "Консультацияға жазылыңыз",
        "en": "Sign up for a consultation"
    },
    "prescriptions_day_buttons": {
        "ru": ["Сегодня", "Вчера"],
        "kz": ["Бүгін", "Кеше"],
        "en": ["Today", "Yesterday"]
    },
    "presc_time_prefix": {
        "ru": "Назначено на:",
        "kz": "Тағайындалған уақыты:",
        "en": "Scheduled for:"
    },
    "presc_delivered": {
        "ru": "Выдано ✅",
        "kz": "Берілді ✅",
        "en": "Delivered ✅"
    },
    "vital_temp": {
        "ru": "🌡️ Температура",
        "kz": "🌡️ Температура",
        "en": "🌡️ Temperature"
    },
    "vital_saturation": {
        "ru": "🫁 Сатурация",
        "kz": "🫁 Сатурация",
        "en": "🫁 Saturation"
    },
    "vital_pressure": {
        "ru": "❤️ Давление",
        "kz": "❤️ Қан қысымы",
        "en": "❤️ Blood Pressure"
    },
    "vital_pulse": {
        "ru": "Пульс",
        "kz": "Пульс",
        "en": "Pulse"
    },
    "your_schedule": {
        "ru": "Ваши записи",
        "kz": "Сіздің жазбаларыңыз",
        "en": "Your appointments"
    },
    "doctor": {
        "ru": "Врач",
        "kz": "Дәрігер",
        "en": "Doctor"
    },


    "no_vitals": {
        "ru": "Нет данных на этот день.",
        "kz": "Бұл күнге деректер жоқ.",
        "en": "No data for this day."
    },
    "no_discharges": {
        "ru": "Выписок или заключений пока нет.",
        "kz": "Қорытындылар әлі жоқ.",
        "en": "No discharge summaries yet."
    },
    "presc_not_delivered": {
        "ru": "Не выдано ❌",
        "kz": "Берілмеген ❌",
        "en": "Not delivered ❌"
    },
    "not_found": {
        "ru": "Пользователь с номером {phone} не найден.",
        "kz": "{phone} нөмірі бойынша пайдаланушы табылмады.",
        "en": "No user found with the number {phone}."
    },
    "wrong_contact": {
        "ru": "Пожалуйста, отправьте свой номер телефона, используя кнопку. Авторизация возможна только через ваш Telegram-номер.",
        "kz": "...",
        "en": "Please share your phone number using the button. Authorization is only possible via your own Telegram-linked number."
    },
    "only_contact_allowed": {
        "ru": "Пожалуйста, используйте кнопку, чтобы отправить номер телефона.",
        "kz": "...",
        "en": "Please use the button to send your phone number."
    },
    "wrong_iin": {
        "ru": "ИИН неверный. Попробуйте ещё раз.",
        "kz": "...",
        "en": "Incorrect IIN. Please try again."
    },
    "api_connect_error": {
        "ru": "Ошибка при подключении к API.",
        "kz": "API-ге қосылу қатесі.",
        "en": "Error connecting to the API."
    },
    "api_response_error": {
        "ru": "Ошибка при получении данных с сервера.",
        "kz": "Серверден деректерді алу қатесі.",
        "en": "Error while retrieving data from server."
    },
    "no_visits": {
        "ru": "У вас пока не было обращений.",
        "kz": "Сізде әлі қаралу болған жоқ.",
        "en": "You haven't had any visits yet."
    },
    "no_current_hospital": {
        "ru": "У вас нет текущей госпитализации.",
        "kz": "Сізде ағымдағы госпитализация жоқ.",
        "en": "You have no active hospitalization."
    },
    "missing_patient_id": {
        "ru": "Ошибка: не найден ID пациента.",
        "kz": "Қате: пациенттің ID табылмады.",
        "en": "Error: Patient ID not found."
    },
    "file_sent": {
        "ru": "Вот ссылка ваш документ 📄",
        "kz": "Мұнда құжатыңызға сілтеме берілген 📄",
        "en": "Here is the link to your document 📄"
    },
    "file_failed": {
        "ru": "Не удалось получить файл 😞",
        "kz": "Файлды жүктеу сәтсіз аяқталды 😞",
        "en": "Failed to fetch the file 😞"
    },
    "file_not_ready": {
        "ru": "Документ ещё не готов. Попробуйте позже 🕒",
        "kz": "Құжат әлі дайын емес. Кейінірек көріңіз 🕒",
        "en": "The document is not ready yet. Please try again later 🕒"
    },
    "unauthorized": {
        "ru": "Ошибка авторизации. Пожалуйста, повторите вход.",
        "kz": "Авторизация қатесі. Қайталап көріңіз.",
        "en": "Authorization error. Please log in again."
    },
    "session_expired": {
        "ru": "Сеанс истёк. Пожалуйста, авторизуйтесь снова.",
        "kz": "Сеанс аяқталды. Қайта кіруді өтінеміз.",
        "en": "Session expired. Please log in again."
    },
    "no_prescriptions": {
        "ru": "Нет назначений на эту дату.",
        "kz": "Бұл күнге тағайындаулар жоқ.",
        "en": "No prescriptions for this date."
    },
    "no_schedule": {
        "ru": "У вас пока нет записей.",
        "kz": "Сізде әлі жазбалар жоқ.",
        "en": "You don't have any entries yet."
    }
}
